Tan1347/ESP32-C3_PPG_Data_Collector/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32c3"

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=32768
CONFIG_MAIN_TASK_STACK_SIZE=32768
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y

# NimBLE (v6.0.1 default BLE stack)
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1      # Only 1 BLE connection needed

# WiFi power optimization
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=6
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=6
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n
CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT=n   # No enterprise WiFi needed

# Flash (DIO 40MHz for stability)
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_40M=y

# Log level (WARN = less strings in flash)
CONFIG_LOG_DEFAULT_LEVEL_WARN=y
CONFIG_LOG_DYNAMIC_LEVEL_CONTROL=n
CONFIG_LOG_TAG_LEVEL_IMPL=y

# Compiler optimizations for size
CONFIG_COMPILER_OPTIMIZATION_ASSERTION_LEVEL_SILENT=y
CONFIG_COMPILER_OPTIMIZATION_CHECKS_SILENT=y
CONFIG_ESP_ERR_TO_NAME_LOOKUP=n         # Remove error code lookup table
CONFIG_ESP_SYSTEM_USE_FRAME_POINTER=y   # Enable frame pointer for backtrace

# UART0 Console (GPIO20-RX, GPIO21-TX, 1M baud)
CONFIG_ESP_CONSOLE_UART_CUSTOM=y
CONFIG_ESP_CONSOLE_UART_TX_GPIO=21
CONFIG_ESP_CONSOLE_UART_RX_GPIO=20
CONFIG_ESP_CONSOLE_UART_BAUDRATE=1000000
CONFIG_ESPTOOLPY_MONITOR_BAUD=1000000
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y  # Disable USB Serial/JTAG secondary console

# Power Management
CONFIG_PM_ENABLE=y
CONFIG_PM_DFS_INIT_AUTO=y

# Auto Light-sleep (idle power: 21mA → ~1mA)
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y
CONFIG_FREERTOS_IDLE_TIME_BEFORE_SLEEP=3
CONFIG_PM_POWER_DOWN_CPU_IN_LIGHT_SLEEP=y
CONFIG_ESP_PHY_MAC_BB_PD=y

# Brownout detection threshold (WiFi TX LDO drop, Level 7 ≈ 2.51V)
CONFIG_ESP_BROWNOUT_DET_LVL_SEL_7=y

# RTC clock: use 8MD256 (8MHz/256=31.25kHz) for better deep-sleep timer accuracy
# (RC_SLOW ~136kHz has ±40% drift, 8MD256 has ±5% drift)
CONFIG_RTC_CLK_SRC_INT_8MD256=y
CONFIG_RTC_CLK_CAL_CYCLES=0  # Skip calibration to save startup time

# Deep-sleep fast boot - DISABLED (risky: flash corruption won't be detected)
# CONFIG_BOOTLOADER_SKIP_VALIDATE_IN_DEEP_SLEEP=y

# mbedTLS: disable debug + unused features
CONFIG_MBEDTLS_DEBUG_LEVEL=0
CONFIG_MBEDTLS_HAVE_TIME=n
CONFIG_MBEDTLS_SHA512_C=n
CONFIG_MBEDTLS_SSL_RENEGOTIATION=n
CONFIG_MBEDTLS_CCM_C=n
CONFIG_MBEDTLS_GCM_C=n

# lwIP: disable IPv6 (only need IPv4)
CONFIG_LWIP_IPV6=n

# TCP buffer optimization for file download
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=8192
CONFIG_LWIP_TCP_WND_DEFAULT=8192

# 禁用浮点 printf（减少栈消耗）
CONFIG_LIBC_NEWLIB_NANO_FORMAT=y

# Line ending: LF for both stdout and stdin (Linux compatible)
CONFIG_LIBC_STDOUT_LINE_ENDING_LF=y
CONFIG_LIBC_STDIN_LINE_ENDING_LF=y

# FATFS (FAT32 support)
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255

# HTTP Server
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512
